// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

Console.WriteLine("Введите число от 1 до 7:");
int days = Convert.ToInt32(Console.ReadLine());


int a = 4;
int b = (int) ((Day) a);
Console.WriteLine(b);

enum Day { 
    monday = 6,
    hhhhh,
    kjhgh,
    gkjghskj,    
    saturday = 7 
    }

